Tester/src/InformationRegisters/Editing/Editing.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Editing</name>
  <resources>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Scenario</name>
    <type>
      <types>CatalogRef.Scenarios</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/InformationRegisters/Editing/ManagerModule.bsl
Procedure Lock ( User, Scenario ) export
	
	r = InformationRegisters.Editing.CreateRecordManager ();
	r.Scenario = Scenario;
	r.User = User;
	r.Date = CurrentSessionDate ();
	r.Write ();
	
EndProcedure
